/*
  Localizable.strings


  Created by Adrian Duermael on 12/9/15.

*/

////////////////////////////////////////////////////////////
///
/// URLs
///
////////////////////////////////////////////////////////////
"UrlsDocumentation" = "https://docs.docker.com/docker-for-mac";
"UrlsForums" = "https://forums.docker.com/c/docker-for-mac";

////////////////////////////////////////////////////////////
///
/// StatusItem (whale icon and menu)
///
////////////////////////////////////////////////////////////
"StatusItemDockerStateRunning" = "Docker is Running";
"StatusItemDockerStateStarting" = "Docker is Starting";


////////////////////////////////////////////////////////////
///
/// Environment checks (hardware requirements)
///
////////////////////////////////////////////////////////////
"CheckHostVersionError" = "Incompatible OS X Version";
"CheckHostVersionErrorDetails" = "Docker requires OS X version %1$d.%2$d.%3$d or higher. %4$@ detected.";
"CheckHostCPUError" = "Incompatible CPU detected.";
"CheckHostCPUErrorDetails" = "Docker requires a processor with virtualization capabilities.\n\nTo learn more about this issue see:\n\n[https://docs.docker.com/docker-for-mac/troubleshoot](https://docs.docker.com/docker-for-mac/troubleshoot/#incompatible-cpu-detected)";
"CheckHostRAMError" = "Not enough RAM";
// fatal error message displayed is the host does not have enough physical memory
// parameters: - RAM required by Docker for Mac in bytes (UInt64)
//             - RAM actually installed on the host in bytes (UInt64)
"CheckHostRAMErrorDetails" = "Docker requires %llu bytes or RAM to run.\nWe detected %llu bytes available";
"CheckVBoxVersionError" = "Docker does not rely on Virtualbox but may not work properly on systems with VirtualBox versions prior to v%d.%d.%d\nVirtualBox v%d.%d.%d is currently installed.\nPlease upgrade or uninstall Virtualbox.";

////////////////////////////////////////////////////////////
///
/// Onboarding / Installation
///
////////////////////////////////////////////////////////////

// popup title: yosemite warning
"yosemiteIssuesTitle" = "You are using OS X Yosemite";
// popup message: yosemite warning
"yosemiteIssuesMessage" = "After wake-up from sleep mode, Docker for Mac may consume a large amount of system CPU indefinitely. This is a known issue on OS X Yosemite, as indicated in the release notes.\n\nFor now, restarting Docker for Mac will likely solve the problem.";

// popup title: welcome to docker beta
"welcomeBetaMessage" = "Welcome to Docker for Mac!";
"welcomeBetaAdditionalMessage" = "We are whaly happy to have you.";
// popup title: warning for root password prompt
"privilegedAccessWarningTitle" = "Docker needs privileged access.";

// popup message: warning for root password prompt
"privilegedAccessWarningMessage" = "Docker for Mac needs privileged access to install its networking components and links to the Docker apps.\n\nYou will be asked for your password.";

// Toolbox migration
"toolboxMigrationTitle" = "Toolbox migration assistant";
"toolboxMigrationMessage" = "A local machine named \"default\" has been found. It is probably the one hosting your Docker images and containers if you previously used Docker Toolbox. Do you want to copy data from that machine?";
"toolboxMigrationMigrateButton" = "Copy";
"toolboxMigrationNoButton" = "No";
"toolboxMigrationLoading" = "Images and containers are being migrated...";
"toolboxMigrationFailed" = "Failed to migrate images and containers: %@";
"toolboxMigrationSuccess" = "Existing images and containers have been successfully copied!";

// root privileges
"installAsRootNonAdminUserErrorTitle" = "Administrator privileges are required.";
"installAsRootNonAdminUserError" = "You need administrator privileges on this computer to install Docker. Please log in as an administrator to install the app, then you can use Docker with standard user accounts.";
"installAsRootNonAdminUserErrorExitBtn" = "Exit";

// welcome popover
"welcomePopoverStartingText1" = "Docker is starting...";
"welcomePopoverStartingText2" = "Hang on for a moment.";
"welcomePopoverRunningText1" = "Docker is now up and running!";
"welcomePopoverRunningText2" = "Open your favorite terminal and start typing Docker commands!";

////////////////////////////////////////////////////////////
///
/// Settings
///
////////////////////////////////////////////////////////////

// Disk usage
"settingsDiskUsageHDLabel" = "%@ - %.2fGB free of %.2fGB";
"settingsDiskUsageDockerLabel" = "Docker";
"settingsDiskUsageDockerUsageLabel" = "%.2fGB (logs: %.2fGB)";
"settingsDiskUsageOthersLabel" = "Others";
"settingsDiskUsageOthersUsageLabel" = "%.2fGB";

// Main window
"settingsMemoryLabel" = "Memory: %@";
"settingsCPUsLabel" = "CPUs: %d";
"settingsChannelText" = "This is a %@ version. You can switch to [%@](https://docs.docker.com/docker-for-mac/faqs/#/stable-and-beta-channels).";

// Apply advanced settings popup
"settingsApplySettingsTitle" = "Apply changes.";
"settingsApplySettingsMessage" = "Some changes have not been applied. Would you like to apply them?";
"settingsApplySettingsBtnDont" = "Don't apply";
"settingsApplySettingsBtnApply" = "Apply";
"settingsApplySettingsBtnCancel" = "Cancel";

//FileSharingView
"settingsFileSharingDocLink" = "These OS X directories (and their subdirectories) can be bind mounted into Docker containers. These exported directories cannot overlap.\nYou can check the [documentation](https://docs.docker.com/docker-for-mac/osxfs/#namespaces) for more details.";

// Uninstall popup
"uninstallWarningTitle" = "Uninstall Docker.";
"uninstallWarningMessage" = "You are about to uninstall Docker. This will destroy all Docker containers and images local to the machine, It will also remove all files that were generated by the application.\n\nAre you sure you want to continue?";
"uninstallWarningCancelButton" = "Cancel";
"uninstallWarningOkButton" = "Uninstall Docker";
"uninstallProgressMessage" = "Uninstalling Docker...";
"uninstallFailed" = "Sorry, something went wrong when uninstalling Docker: %@";
"uninstallSuccessMessage" = "Docker uninstalled successfully. You can move the Docker application to the trash.";
"uninstallSuccessQuitButton" = "Quit";

// reset to factory defaults warning popup
"factoryResetWarningTitle" = "Reset Docker to factory defaults.";
"factoryResetWarningMessage" = "You are about to reset Docker. A factory reset destroys all Docker containers and images local to the machine, and restores the application to its original state, as when it was first installed.\n\nAre you sure you want to continue?";
"factoryResetWarningCancelButton" = "Cancel";
"factoryResetWarningOkButton" = "Reset Docker";
"factoryResetProgressMessage" = "Resetting factory defaults...";
"factoryResetFailed" = "Sorry, something went wrong when resetting factory defaults: %@";
"factoryResetSuccessMessage" = "Docker has reset successfully. The application will restart now.";
"factoryResetRestartButton" = "Restart";

// Docker states
"dockerStateRunning" = "Docker is running";
"dockerStateStarting" = "Docker starting…";

// Error messages related to backend API use
"settingsApiGeneralRetrieveError" = "Failed to retrieve settings values.\n\n%@";
"settingsApiGeneralSetError" = "Failed to change settings values.\n\n%@";
"settingsApiMemoryRetrieveError" = "Failed to retrieve the memory setting value.";
"settingsApiCpusRetrieveError" = "Failed to retrieve the cpus setting value.";
"settingsApiDaemonJsonRetrieveError" = "Failed to retrieve the daemon setting value.";
"settingsApiRetrieveError" = "Failed to retrieve settings values.";
"settingsApiSysctlconfRetrieveError" = "Failed to retrieve the sysctlconf setting value.";
"settingsApiCannotPrepareRequestError" = "Cannot apply settings.";
"settingsApiApplySettingsRequestError" = "Failed to apply settings.";
// sysctl.conf
"settingsReadFileError" = "Failed to read file.";

////////////////////////////////////////////////////////////
///
/// Diagnose & Feedback
///
////////////////////////////////////////////////////////////

"DiagnoseAndFeedbackProgressLabel" = "Diagnosing...";
"DiagnoseAndFeedbackUploadDiagnosticBtn" = "Upload diagnostic";
"DiagnoseAndFeedbackOpenDocsBtn" = "Open documentation";
"DiagnoseAndFeedbackDiagnosticIdTitle" = "Diagnostic ID:";
"DiagnoseAndFeedbackOpenIssuesBtn" = "Open Issues";

"DiagnoseAndFeedbackText1" = "If you have questions about Docker for Mac, we suggest you read our documentation first, you may find your answers:\n[docs.docker.com/docker-for-mac](https://docs.docker.com/docker-for-mac/)";
"DiagnoseAndFeedbackText2" = "**If you need help**, please create an issue with the diagnostic ID in the docker/for-mac GitHub repository!";

"DiagnoseAndFeedbackUpload" = "#666666#Diagnostic will be uploaded while you type your message.##";
"DiagnoseAndFeedbackUploading" = "#666666#Uploading diagnostic...##";
"DiagnoseAndFeedbackUploaded" = "#666666#Diagnostic has been uploaded!##";
"DiagnoseAndFeedbackUploadError" = "#ff0000#Error, diagnostic can't be uploaded.##";


"DiagnoseAndFeedbackIssueURL" = "https://github.com/docker/for-mac/issues/new?body=%@";
"DiagnoseAndFeedbackIssueMessage" = "### Expected behavior\n\n### Actual behavior\n\n### Information\n\n%@\n### Steps to reproduce\n\n1. ...\n2. ...";
"DiagnoseAndFeedbackIssueMessageInfo" = "Diagnostic ID: %1$@\n%2$@\n%3$@\n%4$@";

////////////////////////////////////////////////////////////
///
/// Notifications
///
////////////////////////////////////////////////////////////

// Docker updated notification
"dockerUpdatedNotificationTitle" = "Docker has been updated!";
"dockerUpdatedNotificationInfo" = "New version is %@";

////////////////////////////////////////////////////////////
///
/// Misc
///
////////////////////////////////////////////////////////////

// Next
"Next" = "Next";
// Close
"Close" = "Close";
// Quit
"Quit" = "Quit";
// Cancel
"Cancel" = "Cancel";
// Submit
"Submit" = "Submit";
// Ok
"Ok" = "OK";
// Thank you!
"thankYouExclamationMark" = "Thank you!";
// Error
"Error" = "Error";

////////////////////////////////////////////////////////////
///
/// Fatal error messages
///
////////////////////////////////////////////////////////////

"fatalErrorDiagnoseAndFeedbackBtn" = "Diagnose & Feedback...";
"fatalErrorExitBtn" = "Exit";
"fatalErrorBackBtn" = "Back";

// error message: failed to retrieve hardware UUID value
"hardwareUuidRetrievalError" = "Cannot obtain hardware UUID";

////////////////////////////////////////////////////////////
///
/// Kitematic
///
////////////////////////////////////////////////////////////

"kitematicInfo" = "Kitematic is compatible with Docker for Mac and can be used as a graphical interface to manage your Docker containers. You can download it **[here](https://download.docker.com/kitematic/Kitematic-Mac.zip)**. (make sure you install it in `/Applications`)";

"kitematicInfoVersion" = "Kitematic needs to be updated.\nInstalled version: **%d.%d.%d** - Required version: **%d.%d.%d**\nYou can download the most recent version **[here](https://download.docker.com/kitematic/Kitematic-Mac.zip)**. (make sure you install it in `/Applications`)";
